import Region from "../../entity/Region";

const arr: string[] = [
	"Абзелиловский",
	"Альшеевский",
	"Архангельский",
	"Аскинский",
	"Аургазинский",
	"Баймакский",
	"Бакалинский",
	"Балтачевский",
	"Белебеевский",
	"Белокатайский",
	"Белорецкий",
	"Бижбулякский",
	"Бирский",
	"Благоварский",
	"Благовещенский",
	"Буздякский",
	"Бураевский",
	"Бурзянский",
	"Гафурийский",
	"Давлекановский",
	"Дуванский",
	"Дюртюлинский",
	"Ермекеевский",
	"Зианчуринский",
	"Зилаирский",
	"Иглинский",
	"Илишевский",
	"Ишимбайский",
	"Калтасинский",
	"Караидельский",
	"Кармаскалинский",
	"Кигинский",
	"Краснокамский",
	"Кугарчинский",
	"Кушнаренковский",
	"Куюргазинский ",
	"Мелеузовский",
	"Мечетлинский",
	"Мишкинский",
	"Миякинский",
	"Нуримановский",
	"Салаватский",
	"Стерлибашевский",
	"Стерлитамакский",
	"Татышлинский",
	"Туймазинский",
	"Уфимский",
	"Учалинский",
	"Фёдоровский",
	"Хайбуллинский",
	"Чекмагушевский",
	"Чишминский",
	"Шаранский",
	"Янаульский",
];

export default async function SeedRegions() {
	let id = 1;
	for (const item of arr) {
		var data = new Region();
		data.id = id;
		data.name = item;
		await Region.save(data);
		id++;
	}
}
